tests/tools/artillery/stressTests/psql.itemById.yml
config:
  target: 'http://0.0.0.0:3000'
  phases:
    - duration: 60
      arrivalRate: 20
      rampTo: 2500
      name: 'Warm up server'
    - duration: 60
      arrivalRate: 2500
      rampTo: 7500
      name: 'Ramp'
    - duration: 60
      arrivalRate: 10000
      name: 'Target Load'
  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567'
scenarios:
  - flow:
      - get:
          url: '/items/psql/{{$randomNumber(0,100000000)}}'